#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.FRUITDimitri.data.github_user.main: Refreshing state...
module.planets.github_repository.main: Refreshing state... [id=planets]
module.blog_eleven-labs_com.github_repository.main: Refreshing state... [id=blog.eleven-labs.com]
module.codelabs.github_repository.main: Refreshing state... [id=codelabs]
module.api-validator.github_repository.main: Refreshing state... [id=api-validator]
module.LENGLETMartin.data.github_user.main: Refreshing state...
module.BILLARDMADRIERESVictor.data.github_user.main: Refreshing state...
module.wheel-of-fortune.github_repository.main: Refreshing state... [id=wheel-of-fortune]
module.BRENOTPierre.data.github_user.main: Refreshing state...
module.github.github_repository.main: Refreshing state... [id=github]
module.CORDIERKevin.data.github_user.main: Refreshing state...
module.DURANDHugo.data.github_user.main: Refreshing state...
module.DRUONMehdi.data.github_user.main: Refreshing state...
module.developers.github_team.main: Refreshing state... [id=642624]
module.DELPEYROUXVictor.data.github_user.main: Refreshing state...
module.CLAVIERAnais.data.github_user.main: Refreshing state...
module.MINASYANMarie.data.github_user.main: Refreshing state...
module.DUNGKevin.data.github_user.main: Refreshing state...
module.GREVINNicolas.data.github_user.main: Refreshing state...
module.LANAUGregory.data.github_user.main: Refreshing state...
module.MIGEOTDEBARANFabrice.data.github_user.main: Refreshing state...
module.PEAUDECERFMarion.data.github_user.main: Refreshing state...
module.WILSON.data.github_user.main: Refreshing state...
module.FEIREISENBenjamin.data.github_user.main: Refreshing state...
module.BENAIMMichael.data.github_user.main: Refreshing state...
module.BERNARDJeremy.data.github_user.main: Refreshing state...
module.BETHMONTThomas.data.github_user.main: Refreshing state...
module.GREAUXJeremy.data.github_user.main: Refreshing state...
module.MOATIJacques.data.github_user.main: Refreshing state...
module.BRUGIDOUThibaut.data.github_user.main: Refreshing state...
module.COURBORenaud.data.github_user.main: Refreshing state...
module.THUONThierry.data.github_user.main: Refreshing state...
module.PASQUETFabien.data.github_user.main: Refreshing state...
module.KONTOMARKOSSophie.data.github_user.main: Refreshing state...
module.ALLIERAlexandre.data.github_user.main: Refreshing state...
module.FERTDimitri.data.github_user.main: Refreshing state...
module.PEJOUTThomas.data.github_user.main: Refreshing state...
module.LAHJAILYYacine.data.github_user.main: Refreshing state...
module.AMARBenjamin.data.github_user.main: Refreshing state...
module.ALGRINThibaut.data.github_user.main: Refreshing state...
module.CADOUXMartin.data.github_user.main: Refreshing state...
module.BERRYElsa.data.github_user.main: Refreshing state...
module.MASCLEFRomain.data.github_user.main: Refreshing state...
module.CANALGuillem.data.github_user.main: Refreshing state...
module.LEROUGEPierre.data.github_user.main: Refreshing state...
module.DURANDRomain.data.github_user.main: Refreshing state...
module.MOUTTEAnthony.data.github_user.main: Refreshing state...
module.DIOURIYounes.data.github_user.main: Refreshing state...
module.MAIREAUXMaxence.data.github_user.main: Refreshing state...
module.hq.github_team.main: Refreshing state... [id=2362575]
module.core.github_team.main: Refreshing state... [id=540795]
module.EINHORNStephane.data.github_user.main: Refreshing state...
module.OGRENCarl.data.github_user.main: Refreshing state...
module.CHARRONMaeva.data.github_user.main: Refreshing state...
module.JACQUEMINArthur.data.github_user.main: Refreshing state...
module.amp-jekyll.github_repository.main: Refreshing state... [id=amp-jekyll]
module.jekyll-multiple-languages-plugin.github_repository.main: Refreshing state... [id=jekyll-multiple-languages-plugin]
module.SAILLARDDamien11.data.github_user.main: Refreshing state...
module.BERTRANDVincent.data.github_user.main: Refreshing state...
module.SURPierre.data.github_user.main: Refreshing state...
module.PIERLOTRomain.data.github_user.main: Refreshing state...
module.VERNEUILFlorian.data.github_user.main: Refreshing state...
module.HUCHONThibaud.data.github_user.main: Refreshing state...
module.ELFARSAOUIKamal.data.github_user.main: Refreshing state...
module.VEBERArnaud.data.github_user.main: Refreshing state...
module.JARDINETRemy.data.github_user.main: Refreshing state...
module.BOILLONYannick.data.github_user.main: Refreshing state...
module.MAVILLAZRemi.data.github_user.main: Refreshing state...
module.GORRONCharlesEric.data.github_user.main: Refreshing state...
module.CALONEBastien.data.github_user.main: Refreshing state...
module.SAILLARDDamien.data.github_user.main: Refreshing state...
module.KANIANoel.data.github_user.main: Refreshing state...
module.ANDREAlexandre.data.github_user.main: Refreshing state...
module.SOLOMONEmmanuel.data.github_user.main: Refreshing state...
module.GRAILLONRobin.data.github_user.main: Refreshing state...
module.codelabs.github_issue_label.main[6]: Refreshing state... [id=codelabs:type/fix]
module.codelabs.github_issue_label.main[9]: Refreshing state... [id=codelabs:type/test]
module.codelabs.github_issue_label.main[0]: Refreshing state... [id=codelabs:status/depend]
module.codelabs.github_issue_label.main[3]: Refreshing state... [id=codelabs:status/wip]
module.codelabs.github_issue_label.main[2]: Refreshing state... [id=codelabs:status/reviewable]
module.codelabs.github_issue_label.main[7]: Refreshing state... [id=codelabs:type/question]
module.codelabs.github_issue_label.main[5]: Refreshing state... [id=codelabs:type/feat]
module.codelabs.github_issue_label.main[4]: Refreshing state... [id=codelabs:type/chore]
module.codelabs.github_issue_label.main[8]: Refreshing state... [id=codelabs:type/refactor]
module.codelabs.github_issue_label.main[1]: Refreshing state... [id=codelabs:status/mergeable]
module.codelabs.github_repository_webhook.main[1]: Refreshing state... [id=253136607]
module.codelabs.github_repository_webhook.main[0]: Refreshing state... [id=77131724]
module.github.github_issue_label.main[3]: Refreshing state... [id=github:status/wip]
module.github.github_branch_protection.main[0]: Refreshing state... [id=github:master]
module.github.github_issue_label.main[8]: Refreshing state... [id=github:type/refactor]
module.github.github_issue_label.main[9]: Refreshing state... [id=github:type/test]
module.github.github_issue_label.main[5]: Refreshing state... [id=github:type/feat]
module.github.github_issue_label.main[7]: Refreshing state... [id=github:type/question]
module.github.github_issue_label.main[0]: Refreshing state... [id=github:status/depend]
module.github.github_issue_label.main[2]: Refreshing state... [id=github:status/reviewable]
module.github.github_issue_label.main[4]: Refreshing state... [id=github:type/chore]
module.github.github_issue_label.main[6]: Refreshing state... [id=github:type/fix]
module.github.github_issue_label.main[1]: Refreshing state... [id=github:status/mergeable]
module.planets.github_issue_label.main[4]: Refreshing state... [id=planets:type/chore]
module.planets.github_issue_label.main[6]: Refreshing state... [id=planets:type/fix]
module.planets.github_issue_label.main[8]: Refreshing state... [id=planets:type/refactor]
module.planets.github_issue_label.main[1]: Refreshing state... [id=planets:status/mergeable]
module.planets.github_issue_label.main[2]: Refreshing state... [id=planets:status/reviewable]
module.planets.github_issue_label.main[7]: Refreshing state... [id=planets:type/question]
module.planets.github_issue_label.main[5]: Refreshing state... [id=planets:type/feat]
module.planets.github_issue_label.main[9]: Refreshing state... [id=planets:type/test]
module.planets.github_issue_label.main[3]: Refreshing state... [id=planets:status/wip]
module.planets.github_issue_label.main[0]: Refreshing state... [id=planets:status/depend]
module.api-validator.github_repository_webhook.main[0]: Refreshing state... [id=61952561]
module.api-validator.github_repository_webhook.main[1]: Refreshing state... [id=61898918]
module.api-validator.github_repository_webhook.main[2]: Refreshing state... [id=294754360]
module.blog_eleven-labs_com.github_issue_label.main[8]: Refreshing state... [id=blog.eleven-labs.com:type/refactor]
module.blog_eleven-labs_com.github_issue_label.main[3]: Refreshing state... [id=blog.eleven-labs.com:status/wip]
module.blog_eleven-labs_com.github_issue_label.main[4]: Refreshing state... [id=blog.eleven-labs.com:type/chore]
module.blog_eleven-labs_com.github_issue_label.main[9]: Refreshing state... [id=blog.eleven-labs.com:type/test]
module.blog_eleven-labs_com.github_issue_label.main[1]: Refreshing state... [id=blog.eleven-labs.com:status/mergeable]
module.blog_eleven-labs_com.github_issue_label.main[6]: Refreshing state... [id=blog.eleven-labs.com:type/fix]
module.blog_eleven-labs_com.github_issue_label.main[2]: Refreshing state... [id=blog.eleven-labs.com:status/reviewable]
module.blog_eleven-labs_com.github_issue_label.main[7]: Refreshing state... [id=blog.eleven-labs.com:type/question]
module.blog_eleven-labs_com.github_issue_label.main[0]: Refreshing state... [id=blog.eleven-labs.com:status/depend]
module.blog_eleven-labs_com.github_issue_label.main[5]: Refreshing state... [id=blog.eleven-labs.com:type/feat]
module.wheel-of-fortune.github_issue_label.main[0]: Refreshing state... [id=wheel-of-fortune:status/depend]
module.wheel-of-fortune.github_issue_label.main[3]: Refreshing state... [id=wheel-of-fortune:status/wip]
module.wheel-of-fortune.github_issue_label.main[9]: Refreshing state... [id=wheel-of-fortune:type/test]
module.wheel-of-fortune.github_issue_label.main[2]: Refreshing state... [id=wheel-of-fortune:status/reviewable]
module.wheel-of-fortune.github_issue_label.main[5]: Refreshing state... [id=wheel-of-fortune:type/feat]
module.wheel-of-fortune.github_issue_label.main[1]: Refreshing state... [id=wheel-of-fortune:status/mergeable]
module.wheel-of-fortune.github_issue_label.main[4]: Refreshing state... [id=wheel-of-fortune:type/chore]
module.wheel-of-fortune.github_issue_label.main[6]: Refreshing state... [id=wheel-of-fortune:type/fix]
module.wheel-of-fortune.github_issue_label.main[7]: Refreshing state... [id=wheel-of-fortune:type/question]
module.wheel-of-fortune.github_issue_label.main[8]: Refreshing state... [id=wheel-of-fortune:type/refactor]
module.LENGLETMartin.github_membership.main: Refreshing state... [id=eleven-labs:ulrik59]
module.FRUITDimitri.github_membership.main: Refreshing state... [id=eleven-labs:DimitriMorgan]
module.BRENOTPierre.github_membership.main: Refreshing state... [id=eleven-labs:flipper-ananas]
module.BILLARDMADRIERESVictor.github_membership.main: Refreshing state... [id=eleven-labs:vbillardm]
module.CORDIERKevin.github_membership.main: Refreshing state... [id=eleven-labs:frisoty]
module.DURANDHugo.github_membership.main: Refreshing state... [id=eleven-labs:HugoDurand]
module.DRUONMehdi.github_membership.main: Refreshing state... [id=eleven-labs:MehdiDr]
module.DELPEYROUXVictor.github_membership.main: Refreshing state... [id=eleven-labs:Vik-Th0r]
module.CLAVIERAnais.github_membership.main: Refreshing state... [id=eleven-labs:Anacla]
module.MINASYANMarie.github_membership.main: Refreshing state... [id=eleven-labs:MarieMinasyan]
module.DUNGKevin.github_membership.main: Refreshing state... [id=eleven-labs:KevinDung]
module.GREVINNicolas.github_membership.main: Refreshing state... [id=eleven-labs:nicolas-grevin]
module.LANAUGregory.github_membership.main: Refreshing state... [id=eleven-labs:glanau]
module.MIGEOTDEBARANFabrice.github_membership.main: Refreshing state... [id=eleven-labs:nmss]
module.PEAUDECERFMarion.github_membership.main: Refreshing state... [id=eleven-labs:MarionPdcf]
module.WILSON.github_membership.main: Refreshing state... [id=eleven-labs:ElevenWilson]
module.FEIREISENBenjamin.github_membership.main: Refreshing state... [id=eleven-labs:bfeir-eleven]
module.BENAIMMichael.github_membership.main: Refreshing state... [id=eleven-labs:mikamoush]
module.BERNARDJeremy.github_membership.main: Refreshing state... [id=eleven-labs:BernardJeremy]
module.BETHMONTThomas.github_membership.main: Refreshing state... [id=eleven-labs:thomasbethmont]
module.GREAUXJeremy.github_membership.main: Refreshing state... [id=eleven-labs:JeremyGreaux]
module.MOATIJacques.github_membership.main: Refreshing state... [id=eleven-labs:Jmoati]
module.BRUGIDOUThibaut.github_membership.main: Refreshing state... [id=eleven-labs:Thibaut-Brugidou]
module.COURBORenaud.github_membership.main: Refreshing state... [id=eleven-labs:rcourbo87]
module.THUONThierry.github_membership.main: Refreshing state... [id=eleven-labs:lepiaf]
module.PASQUETFabien.github_membership.main: Refreshing state... [id=eleven-labs:fpasquet]
module.KONTOMARKOSSophie.github_membership.main: Refreshing state... [id=eleven-labs:breizh81]
module.ALLIERAlexandre.github_membership.main: Refreshing state... [id=eleven-labs:aallier]
module.FERTDimitri.github_membership.main: Refreshing state... [id=eleven-labs:dimitri-fert]
module.PEJOUTThomas.github_membership.main: Refreshing state... [id=eleven-labs:ElevenTom]
module.LAHJAILYYacine.github_membership.main: Refreshing state... [id=eleven-labs:Ylahjaily]
module.AMARBenjamin.github_membership.main: Refreshing state... [id=eleven-labs:BenAmarEleven]
module.ALGRINThibaut.github_membership.main: Refreshing state... [id=eleven-labs:ThibautAlgrin]
module.CADOUXMartin.github_membership.main: Refreshing state... [id=eleven-labs:martincadoux]
module.BERRYElsa.github_membership.main: Refreshing state... [id=eleven-labs:ElsaEleven]
module.MASCLEFRomain.github_membership.main: Refreshing state... [id=eleven-labs:rmasclef]
module.CANALGuillem.github_membership.main: Refreshing state... [id=eleven-labs:guillemcanal]
module.LEROUGEPierre.github_membership.main: Refreshing state... [id=eleven-labs:RedPi]
module.DURANDRomain.github_membership.main: Refreshing state... [id=eleven-labs:romaindurand]
module.MOUTTEAnthony.github_membership.main: Refreshing state... [id=eleven-labs:instabledesign]
module.DIOURIYounes.github_membership.main: Refreshing state... [id=eleven-labs:younesdiouri]
module.amp-jekyll.github_issue_label.main[6]: Refreshing state... [id=amp-jekyll:type/fix]
module.amp-jekyll.github_issue_label.main[2]: Refreshing state... [id=amp-jekyll:status/reviewable]
module.amp-jekyll.github_issue_label.main[8]: Refreshing state... [id=amp-jekyll:type/refactor]
module.amp-jekyll.github_issue_label.main[9]: Refreshing state... [id=amp-jekyll:type/test]
module.amp-jekyll.github_issue_label.main[5]: Refreshing state... [id=amp-jekyll:type/feat]
module.amp-jekyll.github_issue_label.main[7]: Refreshing state... [id=amp-jekyll:type/question]
module.amp-jekyll.github_issue_label.main[1]: Refreshing state... [id=amp-jekyll:status/mergeable]
module.amp-jekyll.github_issue_label.main[0]: Refreshing state... [id=amp-jekyll:status/depend]
module.amp-jekyll.github_issue_label.main[3]: Refreshing state... [id=amp-jekyll:status/wip]
module.amp-jekyll.github_issue_label.main[4]: Refreshing state... [id=amp-jekyll:type/chore]
module.jekyll-multiple-languages-plugin.github_issue_label.main[5]: Refreshing state... [id=jekyll-multiple-languages-plugin:type/feat]
module.jekyll-multiple-languages-plugin.github_issue_label.main[3]: Refreshing state... [id=jekyll-multiple-languages-plugin:status/wip]
module.jekyll-multiple-languages-plugin.github_issue_label.main[7]: Refreshing state... [id=jekyll-multiple-languages-plugin:type/question]
module.jekyll-multiple-languages-plugin.github_issue_label.main[8]: Refreshing state... [id=jekyll-multiple-languages-plugin:type/refactor]
module.jekyll-multiple-languages-plugin.github_issue_label.main[9]: Refreshing state... [id=jekyll-multiple-languages-plugin:type/test]
module.jekyll-multiple-languages-plugin.github_issue_label.main[2]: Refreshing state... [id=jekyll-multiple-languages-plugin:status/reviewable]
module.jekyll-multiple-languages-plugin.github_issue_label.main[4]: Refreshing state... [id=jekyll-multiple-languages-plugin:type/chore]
module.jekyll-multiple-languages-plugin.github_issue_label.main[0]: Refreshing state... [id=jekyll-multiple-languages-plugin:status/depend]
module.jekyll-multiple-languages-plugin.github_issue_label.main[1]: Refreshing state... [id=jekyll-multiple-languages-plugin:status/mergeable]
module.jekyll-multiple-languages-plugin.github_issue_label.main[6]: Refreshing state... [id=jekyll-multiple-languages-plugin:type/fix]
module.MAIREAUXMaxence.github_membership.main: Refreshing state... [id=eleven-labs:flemzord]
module.EINHORNStephane.github_membership.main: Refreshing state... [id=eleven-labs:seinhorn]
module.OGRENCarl.github_membership.main: Refreshing state... [id=eleven-labs:RasCarlito]
module.CHARRONMaeva.github_membership.main: Refreshing state... [id=eleven-labs:mcharron11labs]
module.JACQUEMINArthur.github_membership.main: Refreshing state... [id=eleven-labs:ArthurJCQ]
module.SAILLARDDamien11.github_membership.main: Refreshing state... [id=eleven-labs:dsaillard-eleven-labs]
module.BERTRANDVincent.github_membership.main: Refreshing state... [id=eleven-labs:Vubs]
module.SURPierre.github_membership.main: Refreshing state... [id=eleven-labs:psur-eleven]
module.PIERLOTRomain.github_membership.main: Refreshing state... [id=eleven-labs:rpierlot]
module.VERNEUILFlorian.github_membership.main: Refreshing state... [id=eleven-labs:Fverneuil]
module.HUCHONThibaud.github_membership.main: Refreshing state... [id=eleven-labs:ettibo]
module.ELFARSAOUIKamal.github_membership.main: Refreshing state... [id=eleven-labs:elfakamal]
module.VEBERArnaud.github_membership.main: Refreshing state... [id=eleven-labs:VEBERArnaud]
module.JARDINETRemy.github_membership.main: Refreshing state... [id=eleven-labs:Pouzor]
module.BOILLONYannick.github_membership.main: Refreshing state... [id=eleven-labs:yannickBoillon]
module.MAVILLAZRemi.github_membership.main: Refreshing state... [id=eleven-labs:KizeRemi]
module.GORRONCharlesEric.github_membership.main: Refreshing state... [id=eleven-labs:ch3ric]
module.CALONEBastien.github_membership.main: Refreshing state... [id=eleven-labs:BastienCalone]
module.SAILLARDDamien.github_membership.main: Refreshing state... [id=eleven-labs:daemon1981]
module.KANIANoel.github_membership.main: Refreshing state... [id=eleven-labs:snroki]
module.ANDREAlexandre.github_membership.main: Refreshing state... [id=eleven-labs:alex-ception]
module.SOLOMONEmmanuel.github_membership.main: Refreshing state... [id=eleven-labs:manuEleven]
module.GRAILLONRobin.github_membership.main: Refreshing state... [id=eleven-labs:graillus]
module.blog_eleven-labs_com.github_branch_protection.main[0]: Refreshing state... [id=blog.eleven-labs.com:master]
module.hq.github_team_membership.members["BenAmarEleven"]: Refreshing state... [id=2362575:BenAmarEleven]
module.codelabs.github_branch_protection.main[0]: Refreshing state... [id=codelabs:master]
module.hq.github_team_membership.members["ElevenTom"]: Refreshing state... [id=2362575:ElevenTom]
module.hq.github_team_membership.members["ElsaEleven"]: Refreshing state... [id=2362575:ElsaEleven]
module.hq.github_team_membership.members["ElevenWilson"]: Refreshing state... [id=2362575:ElevenWilson]
module.hq.github_team_membership.members["Anacla"]: Refreshing state... [id=2362575:Anacla]
module.developers.github_team_repository.repositories["amp-jekyll"]: Refreshing state... [id=642624:amp-jekyll]
module.developers.github_team_repository.repositories["codelabs"]: Refreshing state... [id=642624:codelabs]
module.developers.github_team_repository.repositories["blog.eleven-labs.com"]: Refreshing state... [id=642624:blog.eleven-labs.com]
module.developers.github_team_repository.repositories["github"]: Refreshing state... [id=642624:github]
module.developers.github_team_repository.repositories["planets"]: Refreshing state... [id=642624:planets]
module.developers.github_team_repository.repositories["wheel-of-fortune"]: Refreshing state... [id=642624:wheel-of-fortune]
module.developers.github_team_repository.repositories["jekyll-multiple-languages-plugin"]: Refreshing state... [id=642624:jekyll-multiple-languages-plugin]
module.core.github_team_repository.repositories["jekyll-multiple-languages-plugin"]: Refreshing state... [id=540795:jekyll-multiple-languages-plugin]
module.hq.github_team_repository.repositories["blog.eleven-labs.com"]: Refreshing state... [id=2362575:blog.eleven-labs.com]
module.core.github_team_repository.repositories["github"]: Refreshing state... [id=540795:github]
module.core.github_team_repository.repositories["wheel-of-fortune"]: Refreshing state... [id=540795:wheel-of-fortune]
module.hq.github_team_repository.repositories["codelabs"]: Refreshing state... [id=2362575:codelabs]
module.hq.github_team_repository.repositories["github"]: Refreshing state... [id=2362575:github]
module.hq.github_team_repository.repositories["jekyll-multiple-languages-plugin"]: Refreshing state... [id=2362575:jekyll-multiple-languages-plugin]
module.core.github_team_repository.repositories["amp-jekyll"]: Refreshing state... [id=540795:amp-jekyll]
module.core.github_team_repository.repositories["codelabs"]: Refreshing state... [id=540795:codelabs]
module.core.github_team_repository.repositories["planets"]: Refreshing state... [id=540795:planets]
module.hq.github_team_repository.repositories["planets"]: Refreshing state... [id=2362575:planets]
module.hq.github_team_repository.repositories["wheel-of-fortune"]: Refreshing state... [id=2362575:wheel-of-fortune]
module.hq.github_team_repository.repositories["amp-jekyll"]: Refreshing state... [id=2362575:amp-jekyll]
module.core.github_team_repository.repositories["blog.eleven-labs.com"]: Refreshing state... [id=540795:blog.eleven-labs.com]
module.core.github_team_membership.members["VEBERArnaud"]: Refreshing state... [id=540795:VEBERArnaud]
module.core.github_team_membership.members["ch3ric"]: Refreshing state... [id=540795:ch3ric]
module.core.github_team_membership.members["daemon1981"]: Refreshing state... [id=540795:daemon1981]
module.core.github_team_membership.members["dsaillard-eleven-labs"]: Refreshing state... [id=540795:dsaillard-eleven-labs]
module.core.github_team_membership.members["snroki"]: Refreshing state... [id=540795:snroki]
module.core.github_team_membership.members["JeremyGreaux"]: Refreshing state... [id=540795:JeremyGreaux]
module.core.github_team_membership.members["Pouzor"]: Refreshing state... [id=540795:Pouzor]
module.developers.github_team_membership.members["fpasquet"]: Refreshing state... [id=642624:fpasquet]
module.developers.github_team_membership.members["Vik-Th0r"]: Refreshing state... [id=642624:Vik-Th0r]
module.developers.github_team_membership.members["ArthurJCQ"]: Refreshing state... [id=642624:ArthurJCQ]
module.developers.github_team_membership.members["HugoDurand"]: Refreshing state... [id=642624:HugoDurand]
module.developers.github_team_membership.members["guillemcanal"]: Refreshing state... [id=642624:guillemcanal]
module.developers.github_team_membership.members["Ylahjaily"]: Refreshing state... [id=642624:Ylahjaily]
module.developers.github_team_membership.members["mikamoush"]: Refreshing state... [id=642624:mikamoush]
module.developers.github_team_membership.members["Maggeuss"]: Refreshing state... [id=642624:Maggeuss]
module.developers.github_team_membership.members["Fverneuil"]: Refreshing state... [id=642624:Fverneuil]
module.developers.github_team_membership.members["seinhorn"]: Refreshing state... [id=642624:seinhorn]
module.developers.github_team_membership.members["Thibaut-Brugidou"]: Refreshing state... [id=642624:Thibaut-Brugidou]
module.developers.github_team_membership.members["MehdiDr"]: Refreshing state... [id=642624:MehdiDr]
module.developers.github_team_membership.members["frisoty"]: Refreshing state... [id=642624:frisoty]
module.developers.github_team_membership.members["ettibo"]: Refreshing state... [id=642624:ettibo]
module.developers.github_team_membership.members["BernardJeremy"]: Refreshing state... [id=642624:BernardJeremy]
module.developers.github_team_membership.members["JeremyGreaux"]: Refreshing state... [id=642624:JeremyGreaux]
module.developers.github_team_membership.members["yannickBoillon"]: Refreshing state... [id=642624:yannickBoillon]
module.developers.github_team_membership.members["thomasbethmont"]: Refreshing state... [id=642624:thomasbethmont]
module.developers.github_team_membership.members["rpierlot"]: Refreshing state... [id=642624:rpierlot]
module.developers.github_team_membership.members["vbillardm"]: Refreshing state... [id=642624:vbillardm]
module.developers.github_team_membership.members["ch3ric"]: Refreshing state... [id=642624:ch3ric]
module.developers.github_team_membership.members["romaindurand"]: Refreshing state... [id=642624:romaindurand]
module.developers.github_team_membership.members["rmasclef"]: Refreshing state... [id=642624:rmasclef]
module.developers.github_team_membership.members["VEBERArnaud"]: Refreshing state... [id=642624:VEBERArnaud]
module.developers.github_team_membership.members["MarieMinasyan"]: Refreshing state... [id=642624:MarieMinasyan]
module.developers.github_team_membership.members["rcourbo87"]: Refreshing state... [id=642624:rcourbo87]
module.developers.github_team_membership.members["Vubs"]: Refreshing state... [id=642624:Vubs]
module.developers.github_team_membership.members["bfeir-eleven"]: Refreshing state... [id=642624:bfeir-eleven]
module.developers.github_team_membership.members["flemzord"]: Refreshing state... [id=642624:flemzord]
module.developers.github_team_membership.members["graillus"]: Refreshing state... [id=642624:graillus]
module.developers.github_team_membership.members["aallier"]: Refreshing state... [id=642624:aallier]
module.developers.github_team_membership.members["daemon1981"]: Refreshing state... [id=642624:daemon1981]
module.developers.github_team_membership.members["instabledesign"]: Refreshing state... [id=642624:instabledesign]
module.developers.github_team_membership.members["RedPi"]: Refreshing state... [id=642624:RedPi]
module.developers.github_team_membership.members["DimitriMorgan"]: Refreshing state... [id=642624:DimitriMorgan]
module.developers.github_team_membership.members["dsaillard-eleven-labs"]: Refreshing state... [id=642624:dsaillard-eleven-labs]
module.developers.github_team_membership.members["MarionPdcf"]: Refreshing state... [id=642624:MarionPdcf]
module.developers.github_team_membership.members["Pouzor"]: Refreshing state... [id=642624:Pouzor]
module.developers.github_team_membership.members["lepiaf"]: Refreshing state... [id=642624:lepiaf]
module.developers.github_team_membership.members["martincadoux"]: Refreshing state... [id=642624:martincadoux]
module.developers.github_team_membership.members["glanau"]: Refreshing state... [id=642624:glanau]
module.developers.github_team_membership.members["snroki"]: Refreshing state... [id=642624:snroki]
module.developers.github_team_membership.members["KevinDung"]: Refreshing state... [id=642624:KevinDung]
module.developers.github_team_membership.members["BastienCalone"]: Refreshing state... [id=642624:BastienCalone]
module.developers.github_team_membership.members["Anacla"]: Refreshing state... [id=642624:Anacla]
module.developers.github_team_membership.members["alex-ception"]: Refreshing state... [id=642624:alex-ception]
module.developers.github_team_membership.members["elfakamal"]: Refreshing state... [id=642624:elfakamal]
module.developers.github_team_membership.members["nmss"]: Refreshing state... [id=642624:nmss]
module.developers.github_team_membership.members["dimitri-fert"]: Refreshing state... [id=642624:dimitri-fert]
module.developers.github_team_membership.members["KizeRemi"]: Refreshing state... [id=642624:KizeRemi]
module.developers.github_team_membership.members["ThibautAlgrin"]: Refreshing state... [id=642624:ThibautAlgrin]
module.developers.github_team_membership.members["breizh81"]: Refreshing state... [id=642624:breizh81]
module.developers.github_team_membership.members["mcharron11labs"]: Refreshing state... [id=642624:mcharron11labs]
module.developers.github_team_membership.members["ulrik59"]: Refreshing state... [id=642624:ulrik59]
module.developers.github_team_membership.members["younesdiouri"]: Refreshing state... [id=642624:younesdiouri]
module.developers.github_team_membership.members["flipper-ananas"]: Refreshing state... [id=642624:flipper-ananas]
module.developers.github_team_membership.members["manuEleven"]: Refreshing state... [id=642624:manuEleven]
module.developers.github_team_membership.members["nicolas-grevin"]: Refreshing state... [id=642624:nicolas-grevin]
module.developers.github_team_membership.members["psur-eleven"]: Refreshing state... [id=642624:psur-eleven]
module.developers.github_team_membership.members["RasCarlito"]: Refreshing state... [id=642624:RasCarlito]
module.developers.github_team_membership.members["Jmoati"]: Refreshing state... [id=642624:Jmoati]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.api-validator.github_issue_label.main[0] will be created
  + resource "github_issue_label" "main" {
      + color       = "d93f0b"
      + description = "status: depend"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "status/depend"
      + repository  = "api-validator"
      + url         = (known after apply)
    }

  # module.api-validator.github_issue_label.main[1] will be created
  + resource "github_issue_label" "main" {
      + color       = "009800"
      + description = "status: mergeable"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "status/mergeable"
      + repository  = "api-validator"
      + url         = (known after apply)
    }

  # module.api-validator.github_issue_label.main[2] will be created
  + resource "github_issue_label" "main" {
      + color       = "1d76db"
      + description = "status: reviewable"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "status/reviewable"
      + repository  = "api-validator"
      + url         = (known after apply)
    }

  # module.api-validator.github_issue_label.main[3] will be created
  + resource "github_issue_label" "main" {
      + color       = "ffdd88"
      + description = "status: wip"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "status/wip"
      + repository  = "api-validator"
      + url         = (known after apply)
    }

  # module.api-validator.github_issue_label.main[4] will be created
  + resource "github_issue_label" "main" {
      + color       = "84b6eb"
      + description = "type: chore"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "type/chore"
      + repository  = "api-validator"
      + url         = (known after apply)
    }

  # module.api-validator.github_issue_label.main[5] will be created
  + resource "github_issue_label" "main" {
      + color       = "1abc9c"
      + description = "type: feat"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "type/feat"
      + repository  = "api-validator"
      + url         = (known after apply)
    }

  # module.api-validator.github_issue_label.main[6] will be created
  + resource "github_issue_label" "main" {
      + color       = "fbca04"
      + description = "type: fix"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "type/fix"
      + repository  = "api-validator"
      + url         = (known after apply)
    }

  # module.api-validator.github_issue_label.main[7] will be created
  + resource "github_issue_label" "main" {
      + color       = "c7def8"
      + description = "type: question"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "type/question"
      + repository  = "api-validator"
      + url         = (known after apply)
    }

  # module.api-validator.github_issue_label.main[8] will be created
  + resource "github_issue_label" "main" {
      + color       = "5319e7"
      + description = "type: refactor"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "type/refactor"
      + repository  = "api-validator"
      + url         = (known after apply)
    }

  # module.api-validator.github_issue_label.main[9] will be created
  + resource "github_issue_label" "main" {
      + color       = "cccccc"
      + description = "type: test"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "type/test"
      + repository  = "api-validator"
      + url         = (known after apply)
    }

  # module.api-validator.github_repository.main will be updated in-place
  ~ resource "github_repository" "main" {
        allow_merge_commit = true
        allow_rebase_merge = true
        allow_squash_merge = true
        archived           = false
        auto_init          = false
        default_branch     = "master"
        description        = "Provide helpers that validate a request against an OpenAPi/Swagger2 API description"
        etag               = "W/\"de7556e372ca9ae3e3b4bcda0bb39fd14b3f87623a68308be51adf6481f51b57\""
        full_name          = "eleven-labs/api-validator"
        git_clone_url      = "git://github.com/eleven-labs/api-validator.git"
        has_downloads      = true
        has_issues         = true
      ~ has_projects       = true -> false
        has_wiki           = true
        html_url           = "https://github.com/eleven-labs/api-validator"
        http_clone_url     = "https://github.com/eleven-labs/api-validator.git"
        id                 = "api-validator"
        name               = "api-validator"
        private            = false
        ssh_clone_url      = "git@github.com:eleven-labs/api-validator.git"
        svn_url            = "https://github.com/eleven-labs/api-validator"
        topics             = []
    }

  # module.api-validator.github_repository_webhook.main[0] will be updated in-place
  ~ resource "github_repository_webhook" "main" {
        active     = true
        events     = [
            "create",
            "delete",
            "issue_comment",
            "member",
            "public",
            "pull_request",
            "push",
            "repository",
        ]
        id         = "61952561"
        repository = "api-validator"
        url        = "https://api.github.com/repos/eleven-labs/api-validator/hooks/61952561"

      ~ configuration {
            content_type = "form"
          ~ insecure_ssl = "0" -> "false"
            url          = "https://notify.travis-ci.org"
        }
    }

  # module.api-validator.github_repository_webhook.main[1] will be updated in-place
  ~ resource "github_repository_webhook" "main" {
        active     = true
        events     = [
            "commit_comment",
            "issue_comment",
            "pull_request",
            "pull_request_review_comment",
            "push",
            "status",
        ]
        id         = "61898918"
        repository = "api-validator"
        url        = "https://api.github.com/repos/eleven-labs/api-validator/hooks/61898918"

      ~ configuration {
            content_type = "json"
          ~ insecure_ssl = "0" -> "false"
            url          = "https://scrutinizer-ci.com/github-callback"
        }
    }

  # module.api-validator.github_repository_webhook.main[2] will be updated in-place
  ~ resource "github_repository_webhook" "main" {
        active     = true
        events     = [
            "push",
        ]
        id         = "294754360"
        repository = "api-validator"
        url        = "https://api.github.com/repos/eleven-labs/api-validator/hooks/294754360"

      ~ configuration {
            content_type = "json"
          ~ insecure_ssl = "0" -> "false"
          ~ secret       = (sensitive value)
            url          = "https://packagist.org/api/update-package?username=guillemcanal"
        }
    }

  # module.core.github_team_repository.repositories["api-validator"] will be created
  + resource "github_team_repository" "repositories" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "api-validator"
      + team_id    = "540795"
    }

  # module.developers.github_team_repository.repositories["api-validator"] will be created
  + resource "github_team_repository" "repositories" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "api-validator"
      + team_id    = "642624"
    }

  # module.hq.github_team_repository.repositories["api-validator"] will be created
  + resource "github_team_repository" "repositories" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "api-validator"
      + team_id    = "2362575"
    }

Plan: 13 to add, 4 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @VEBERArnaud, Action: `pull_request`, Workflow: `terraform`*